package shildt.title_2;

/**
 * Напишите программу, которая находила бы все простые числа в диапазоне от 2 до 100.
 * Другими словами, число x является простым, если оно больше 1 и при этом делится без остатка только на 1 и на x. К примеру, 5.
 */
public class EasyNumbers {
    public static void main(String[] args) {
        int i;
        int j;
        boolean isPrime;

        for (i = 2; i < 100; i++) { //Перебирает все значения от 2 до 99
            isPrime = true; // Для чего мы вводим эту переменную??
            for (j = 2; j <= i / j; j++) {  // Не понимаю сущность этого условия...
                if ((i % j) == 0) { // Проверка на остаток от деления, если есть, то число не делится само на себя, значит не подходит
                    isPrime = false;
                }
            }if (isPrime){ //если остается true, тогда распечатывается данное число
                System.out.println(i);
            }
        }
    }
}